# Тест-кейсы

---

#### Веб-сайт: [NAKD](https://www.na-kd.com/en)

---

### 1. **Добавить товар в корзину**

#### **Предусловие: Главная страница веб-сайта https://www.na-kd.com/en открыта.**

##### 1.1 На главной страица сата выбрать (кликнуть на) категорию товара (Shop Sweaters).

##### 1.2 В появившемся списке кликнуть на необходимый товар (Cable Knit Sweater).

##### 1.3 Нажать на кнопку "Select size".

##### 1.4 В выдвигающемся окне выбрать размер (Small).

##### 1.3 Нажать на кнопку "Add to bag".

#### **Ожидаемый результат: Появилось окно, информирующее нас о том, что товар добавлен в корзину. В правом верхнем углу сайта на значке корзины появилось количество добавленных товаров.**

---

### 2. **Удалить товар из корзины**

#### **Предусловие: Веб-сайт https://www.na-kd.com/en открыт, наличие хотя-бы одного товара в корзине.**

##### 2.1 В верхней панели кликнуть на иконку корзины.

##### 2.2 В всплывающем окне корзины нажать на значок "Удалить" напротив необходимого товара.

#### **Ожидаемый результат: Товар удален из корзины.**

---

### 3. **Добавить в корзину более одного товара**

#### **Предусловие: Открыта вкладка корзины. Наличие хотя-бы одного товара в корзине.**

##### 3.1 Нажать один раз на значок "+" возле необходимого товара.

#### **Ожидаемый результат: В корзине находятся 2 товара.**

---

### 4. **Поиск товаров**

#### **Предусловие: Открыта главная страница сайта.**

##### 4.1 Нажать на поисковую строку.

##### 4.2 Написать название товара.

##### 4.3 Нажать на кнопку лупы или "Enter".

#### **Ожидаемый результат: Согласно вводу отображены товары.**

---

### 5. **Фильтр цены товаров**

#### **Предусловие: Открыта вкладка с перечнем определенного вида товаров.

##### 5.1 В верхней части страницы нажать на кнопку "Price".

##### 5.2 В всплывающем окне выбрать необходимый диапазон цен.

#### **Ожидаемый результат: Из изначального перечня товаров отобразятся товары из введенного диапазона цены.**

---

### 6. **Добавить товар в "Избранное"**

#### **Предусловие: Открыта вкладка с перечнем определенного вида товаров.

##### 8.1 Возле необходимого товара нажимать кнопку "Сердечко".

#### **Ожидаемый результат: Во вкладке "Избранное" появится необходимый товар. Значок "Сердечко" возле выбранного товара изменит цвет с белого на красный. В правом верхнем углу сайта значок "Сердечко" изменит цвет с белого на красный.**

---

### 7. **Удалить необходимый товар из вкладки "Избранное"**

#### **Предусловие: Открыта вкладка "Избранное".

##### 7.1 Нажать на значок "Сердце" напротив необходимого товара.

#### **Ожидаемый результат: Выбранный товар удалится из вкладки "Избранное".**

---

### 8. **Просмотр описания и состава товара**

#### **Предусловие: Открыта вкладка с необходимым товаром.

##### 8.1 Нажать на кнопку "Description & Material".

#### **Ожидаемый результат: Всплывает окно с необходимой информацией.**

---

### 9. **Проверка последних просмотренных товаров**

#### **Предусловие: Веб-сайт https://www.na-kd.com/en открыт.

##### 9.1 В правом верхнем углу страницы нажать на значок "Глаз".

#### **Ожидаемый результат: Всплывает окно с последними просмотренными товарами.**

---

### 10. **Сортировка товаров по последнему поступлению в продажу**

#### **Предусловие: Открыта вкладка с перечнем определенного вида товаров.

##### 10.1 В верхней части страницы нажать на кнопку "Sorted by".

##### 10.2 В всплывающем окне выбрать кнопку "Latest arrivals".

#### **Ожидаемый результат: Изначальный перечень товаров отсортируется по условию последних поступивших в продажу.**

---
